## Introduction to Pandas

[Pandas](http://pandas.pydata.org/) is the essential data analysis library for Python programmers. It provides fast and flexible data structures built on top of [numpy](http://www.numpy.org/).

It is well suited to handle "tabular" data (that might be found in a spreadsheet), time series data, or pretty much anything you care to put in a matrix with rows and named columns.

It contains two primary data structures, the `Series` (1-dimensional) and the `DataFrame` (2-dimensional) as well as a host of convenience methods for loading and plotting data.

The main thing that makes pandas pandas is that all data is *intrinsically aligned*. That means each data structure, `DataFrame` or `Series` has something called an `Index` that links data with a label. That link will always be there (unless you explicitly break or change it) and its what allows pandas to quickly and efficiently "do the right thing" when working with data.

In [1]:
# The canonical way to import pandas:
import pandas as pd
import numpy as np

## Creating DataFrames

Although we will usually be using pandas to analyze data loaded from another source (like CSV files, database tables, even data from the web), it's important to know how to create DataFrames manually.

A `DataFrame` can be constructed with a variety of different kinds of data (lists, 1-d or 2-d `ndarray` objects, etc.) plus  optional **index** (row label) or **columns** (column label) arguments.

In [2]:
players = ['James', 'Irving', 'Love']

data = {
    'Player': players,
    'Jersey Number': [23, 2, 0],
    'Points': [1954, 1816, 1142],
    'Games': [74, 72, 60],
}

df = pd.DataFrame(data)
df

   Games  Jersey Number  Player  Points
0     74             23   James    1954
1     72              2  Irving    1816
2     60              0    Love    1142

In [3]:
# Alternatively, we can create a more meaningful index for ourselves out of the data.

players = ['James', 'Irving', 'Love']

data = {
    'Jersey Number': [23, 2, 0],
    'Points': [1954, 1816, 1142],
    'Games': [74, 72, 60],
}

df = pd.DataFrame(data, index=players)
df

        Games  Jersey Number  Points
James      74             23    1954
Irving     72              2    1816
Love       60              0    1142

We can look at an individual column of a DataFrame by putting its name in square brackets.

In [4]:
df["Games"]

James     74
Irving    72
Love      60
Name: Games, dtype: int64

We can create new columns by just assigning to them:

In [5]:
df["Team"] = "Cavaliers"
df["Year"] = 2016
df

        Games  Jersey Number  Points       Team  Year
James      74             23    1954  Cavaliers  2016
Irving     72              2    1816  Cavaliers  2016
Love       60              0    1142  Cavaliers  2016

We can modify existing columns through assignment:

In [6]:
df["Year"] = df["Year"] + 1
df

        Games  Jersey Number  Points       Team  Year
James      74             23    1954  Cavaliers  2017
Irving     72              2    1816  Cavaliers  2017
Love       60              0    1142  Cavaliers  2017

We can easily combine columns in the DataFrame to make new ones as well:

In [7]:
df["Points Per Game"] = df["Points"] / df["Games"]
df

        Games  Jersey Number  Points       Team  Year  Points Per Game
James      74             23    1954  Cavaliers  2017        26.405405
Irving     72              2    1816  Cavaliers  2017        25.222222
Love       60              0    1142  Cavaliers  2017        19.033333

### About DataFrames

As you can see above, DataFrames contain "tabular" (2-dimensional) data, meaning they have rows and columns.

Each colum has a name, and each row has a label (by default, the labels are integers). This set of row labels in pandas is called an `Index`.

This allows us to address any "cell" in the DataFrame by its row label and column name.

Pandas DataFrames have several properties for addressing and selection, `ix`, `iloc`, and `loc`. Collectively these are called "indexers". `ix` is now deprecated, and the preferred method is `loc`.

`loc` is used for label-based selection, `iloc` for integer position-based selection.

In [8]:
# Select a row by label value
df.loc['James']

Games                     74
Jersey Number             23
Points                  1954
Team               Cavaliers
Year                    2017
Points Per Game      26.4054
Name: James, dtype: object

In [9]:
# Select a row by position
df.iloc[1]

Games                     72
Jersey Number              2
Points                  1816
Team               Cavaliers
Year                    2017
Points Per Game      25.2222
Name: Irving, dtype: object

`loc` accepts the following types of inputs:

- a single label (as above)
- a list or array of labels, e.g. ['a', 'b', 'c']
- a slice object with labels e.g. 'a':'c' (note that contrary to usual python slices, both the start and the stop are included!)
- A boolean array
- A callable function with one argument (the calling Series, DataFrame or Panel) and that returns valid output for indexing (one of the above)

`loc` and `iloc` also take an optional second parameter, the list of column names to return:

In [10]:
df.loc[['Irving', 'Love'], ['Games', 'Points', 'Year']]

        Games  Points  Year
Irving     72    1816  2017
Love       60    1142  2017

## Loading Data

Pandas provides a bunch of functions for reading data from a variety of sources, including CSV, Excel files, SQL databases, HDF5, even your computer's clipboard! The always-comprehensive pandas documentation has more info here: [https://pandas.pydata.org/pandas-docs/stable/io.html](https://pandas.pydata.org/pandas-docs/stable/io.html).

Let's read a local CSV dataset into a dataframe using the `read_csv` function.

In [11]:
df = pd.read_csv("data/Speed_Camera_Violations.csv")

The variable `df` (which is a common abbreviation for "DataFrame") now contains a pandas `DataFrame` object. This particular `DataFrame` contains speed camera violation data provided by the city of Chicago. This dataset is available at [https://catalog.data.gov/dataset/speed-camera-violations-997eb](https://catalog.data.gov/dataset/speed-camera-violations-997eb).

Let's start inspecting it by using the `head` method to look at the first five rows.

In [12]:
df.head()

,ADDRESS,CAMERA ID,VIOLATION DATE,VIOLATIONS,X COORDINATE,Y COORDINATE,LATITUDE,LONGITUDE,LOCATION
0,7738 S WESTERN,CHI065,07/08/2014,65,NaN,NaN,NaN,NaN,NaN
1,1111 N HUMBOLDT,CHI010,07/16/2014,56,NaN,NaN,NaN,NaN,NaN
2,5520 S WESTERN,CHI069,07/08/2014,10,NaN,NaN,NaN,NaN,NaN
3,1111 N HUMBOLDT,CHI010,07/26/2014,101,NaN,NaN,NaN,NaN,NaN
4,1111 N HUMBOLDT,CHI010,07/27/2014,92,NaN,NaN,NaN,NaN,NaN

In [13]:
# display just the first row (note the index is zero-based, meaning the first row is row 0)
df.loc[0]

ADDRESS           7738 S WESTERN
CAMERA ID                 CHI065
VIOLATION DATE        07/08/2014
VIOLATIONS                    65
X COORDINATE                 NaN
Y COORDINATE                 NaN
LATITUDE                     NaN
LONGITUDE                    NaN
LOCATION                     NaN
Name: 0, dtype: object

In [14]:
# We can also address a single column of the DataFrame using its name in square brackets:
df["ADDRESS"]

0               7738 S WESTERN
1              1111 N HUMBOLDT
2               5520 S WESTERN
3              1111 N HUMBOLDT
4              1111 N HUMBOLDT
5               5529 S WESTERN
6              1111 N HUMBOLDT
7               5520 S WESTERN
8               5520 S WESTERN
9               5520 S WESTERN
10              5529 S WESTERN
11              5520 S WESTERN
12              5529 S WESTERN
13              5529 S WESTERN
14              5520 S WESTERN
15             1111 N HUMBOLDT
16             1111 N HUMBOLDT
17              5520 S WESTERN
18             1111 N HUMBOLDT
19              7739 S WESTERN
20             1111 N HUMBOLDT
21              5520 S WESTERN
22             1111 N HUMBOLDT
23              5529 S WESTERN
24             1111 N HUMBOLDT
25             1111 N HUMBOLDT
26              7738 S WESTERN
27              5529 S WESTERN
28              5529 S WESTERN
29              5529 S WESTERN
                  ...
113966    1315 W GARFIELD BLVD
113967    1315 W GARFIELD BLVD
113968     4831 W LAWRENCE AVE
113969          3843 S WESTERN
113970          1901 E 75TH ST
113971          3843 S WESTERN
113972        19 W CHICAGO AVE
113973        19 W CHICAGO AVE
113974        5885 N RIDGE AVE
113975        5885 N RIDGE AVE
113976          3646 W MADISON
113977          1901 E 75TH ST
113978          3843 S WESTERN
113979          3646 W MADISON
113980    1315 W GARFIELD BLVD
113981      3111 N ASHLAND AVE
113982    1315 W GARFIELD BLVD
113983        5885 N RIDGE AVE
113984          3843 S WESTERN
113985    10318 S INDIANAPOLIS
113986        5885 N RIDGE AVE
113987     4831 W LAWRENCE AVE
113988             3851 W 79th
113989          3843 S WESTERN
113990        19 W CHICAGO AVE
113991    1315 W GARFIELD BLVD
113992      2115 S WESTERN AVE
113993        4843 W FULLERTON
113994    10318 S INDIANAPOLIS
113995             3851 W 79th
Name: ADDRESS, Length: 113996, dtype: object

In [15]:
# We can combine the row-based and column-based access with the `loc` indexer to select specific elements
df.loc[1, "ADDRESS"]

'1111 N HUMBOLDT'

In [16]:
# Or a set of rows and columns. Note we can ask for a list of columns in any order:
df.loc[1000:1010, ["ADDRESS", "VIOLATION DATE"]]

                   ADDRESS VIOLATION DATE
1000        2443 N ASHLAND     10/22/2014
1001       1111 N HUMBOLDT     10/22/2014
1002     515 S CENTRAL AVE     10/22/2014
1003        4433 N WESTERN     10/22/2014
1004         6909 S KEDZIE     10/22/2014
1005           2513 W 55TH     10/22/2014
1006        2440 W 51ST ST     10/22/2014
1007         4965 S ARCHER     10/22/2014
1008          5440 W GRAND     10/22/2014
1009    6443 W BELMONT AVE     10/22/2014
1010  6510 W BRYN MAWR AVE     10/22/2014

## About Series

Each column in the DataFrame is a `Series` object. You can think of a `Series` as an `ndarray` from numpy with an `Index` (the same row-label functionality from `DataFrame`).

The important thing to remember is that each element in the `Series` has the same type, just like an `ndarray`.

The `dtype` property of a `Series` tells us what its type is.

In [17]:
print(df.columns)
print()
for col in df.columns:
    print("The dtype of %s is %s." % (col, df[col].dtype))

Index(['ADDRESS', 'CAMERA ID', 'VIOLATION DATE', 'VIOLATIONS', 'X COORDINATE',
       'Y COORDINATE', 'LATITUDE', 'LONGITUDE', 'LOCATION'],
      dtype='object')

The dtype of ADDRESS is object.
The dtype of CAMERA ID is object.
The dtype of VIOLATION DATE is object.
The dtype of VIOLATIONS is int64.
The dtype of X COORDINATE is float64.
The dtype of Y COORDINATE is float64.
The dtype of LATITUDE is float64.
The dtype of LONGITUDE is float64.
The dtype of LOCATION is object.

## Data types

Much of pandas functionality depends on the data types of the `Series` it's working with. For instance we can get summary measures and do numpy-like parallel operations on numeric types (`int64`, `float64`), or do date-based arithmetic with `date` series.

Notice above that the data type of the `VIOLATION DATE` column is "object", which, just like in numpy, means it is a generic type that isn't very useful. Let's turn those date strings into actual date objects, which are much better to work with.

In [18]:
# given a Series, pd.to_datetime returns a new Series with the string dates parsed as actual dates.
# We can then directly assign that Series back to the original column in our dataframe and pandas' magical Index
# functionality will make it all line up properly.
df["VIOLATION DATE"] = pd.to_datetime(df["VIOLATION DATE"], format="%m/%d/%Y")

df["VIOLATION DATE"].head()

0   2014-07-08
1   2014-07-16
2   2014-07-08
3   2014-07-26
4   2014-07-27
Name: VIOLATION DATE, dtype: datetime64[ns]

## Filtering

Now that we have a date column, we can do things like filter to only look at violations in 2015.

To do this, we'll create a "filter", essentially a boolean expression that works just like a mask or "fancy indexing" expression in numpy, and apply that filter to our dataframe to get just the rows we want.

In [19]:
import datetime

# note the extra parentheses below, these are necessary when creating a boolean filter expression with
# multiple comparisons like this
date_filter = ((df["VIOLATION DATE"] >= datetime.date(2015,1,1)) & (df["VIOLATION DATE"] < datetime.date(2016,1,1)))

# date_filter now contains a series of true/false values that we can use to extract just the values we are interested in
# by putting it in square brackets after the dataframe variable.
print(date_filter.head())
print()
print(date_filter.tail())

df_2015 = df[date_filter]

df_2015.head()

0    False
1    False
2    False
3    False
4    False
Name: VIOLATION DATE, dtype: bool

113991     True
113992     True
113993    False
113994     True
113995     True
Name: VIOLATION DATE, dtype: bool

,ADDRESS,CAMERA ID,VIOLATION DATE,VIOLATIONS,X COORDINATE,Y COORDINATE,LATITUDE,LONGITUDE,LOCATION
285,2912 W ROOSEVELT,CHI020,2015-01-07,8,1.157040e+06,1.894612e+06,41.866585,-87.698962,"(41.86658528313424, -87.69896237494204)"
286,5816 W JACKSON,CHI058,2015-01-07,22,1.137565e+06,1.898341e+06,41.877189,-87.770370,"(41.87718940463045, -87.7703695017756)"
287,57 E 95TH,CHI035,2015-01-07,4,1.178587e+06,1.841967e+06,41.721657,-87.621463,"(41.72165713317433, -87.62146289865515)"
288,324 S KEDZIE AVE,CHI123,2015-01-07,4,1.155058e+06,1.898247e+06,41.876599,-87.706143,"(41.87659894232968, -87.70614267856668)"
289,5471 W HIGGINS,CHI102,2015-01-07,14,1.139072e+06,1.931898e+06,41.969247,-87.764019,"(41.96924714863934, -87.76401945149458)"

This kind of filtering works for any kind of data type, provided you take care to make sure pandas is using the right data types for your data!

You may have noticed that many of the rows in this dataframe are missing lat/lon data. Pandas uses the "NaN" placeholder for missing data and offers some methods for dealing with it.

Both `Series` and `DataFrame` objects have `fillna` method that will replace missing data with a specified value.

In thise case however we may want to just drop those records that have missing data entirely:

In [20]:
df_no_nans = df.dropna(axis=0, how="any")
df_no_nans.head()

,ADDRESS,CAMERA ID,VIOLATION DATE,VIOLATIONS,X COORDINATE,Y COORDINATE,LATITUDE,LONGITUDE,LOCATION
148,2912 W ROOSEVELT,CHI020,2014-10-16,25,1.157040e+06,1.894612e+06,41.866585,-87.698962,"(41.86658528313424, -87.69896237494204)"
149,346 W 76th ST,CHI136,2014-10-16,4,1.175112e+06,1.854590e+06,41.756374,-87.633817,"(41.7563743554102, -87.6338165847716)"
150,11153 S VINCENNES,CHI022,2014-10-16,6,1.167029e+06,1.830594e+06,41.690702,-87.664122,"(41.690701951255015, -87.66412238501842)"
151,5454 W IRVING PARK,CHI050,2014-10-16,82,1.139043e+06,1.926097e+06,41.953330,-87.764267,"(41.95332954454448, -87.76426726425451)"
152,5446 W FULLERTON,CHI042,2014-10-16,38,1.139460e+06,1.915458e+06,41.924128,-87.762994,"(41.92412849125162, -87.76299399881007)"

## Summary Measures

Pandas will produce simple descriptive statics via the `describe` method:

In [21]:
df["VIOLATIONS"].describe()

count    113996.000000
mean         30.708349
std          38.773222
min           1.000000
25%           7.000000
50%          17.000000
75%          39.000000
max         479.000000
Name: VIOLATIONS, dtype: float64

There are many more built-in methods for producing summary measures which can be found in the [documentation](https://pandas.pydata.org/pandas-docs/stable/api.html#api-dataframe-stats).

For instance, generating quantiles is straightforward:

In [22]:
# deciles, in this case
for i in range(1, 11):
    print("Value at decile %s: %s" % (i/10, df["VIOLATIONS"].quantile(i/10)))

Value at decile 0.1: 3.0
Value at decile 0.2: 5.0
Value at decile 0.3: 9.0
Value at decile 0.4: 12.0
Value at decile 0.5: 17.0
Value at decile 0.6: 23.0
Value at decile 0.7: 33.0
Value at decile 0.8: 47.0
Value at decile 0.9: 74.0
Value at decile 1.0: 479.0